nxp-mcuxpresso/mcux-sdk/devices/MKM14ZA5/drivers/fsl_clock.c
    uint8_t mcg_c5 = 0U;

#if (defined(FSL_FEATURE_MCG_USE_PLLREFSEL) && FSL_FEATURE_MCG_USE_PLLREFSEL)
    mcg_c5 |= MCG_C5_PLLREFSEL0(config->refSrc);
#endif
#if ((defined(FSL_FEATURE_MCG_HAS_PLL_PRDIV) && FSL_FEATURE_MCG_HAS_PLL_PRDIV))
    mcg_c5 |= MCG_C5_PRDIV0(config->prdiv);
#endif
    MCG->C5 = mcg_c5; /* Disable the PLL first. */

#if (defined(FSL_FEATURE_MCG_HAS_PLL_INTERNAL_MODE) && FSL_FEATURE_MCG_HAS_PLL_INTERNAL_MODE)
    MCG->C7 = (uint8_t)((MCG->C7 & ~MCG_C7_PLL32KREFSEL_MASK) | MCG_C7_PLL32KREFSEL(config->refSrc));
#endif

#if (defined(FSL_FEATURE_MCG_HAS_PLL_VDIV) && FSL_FEATURE_MCG_HAS_PLL_VDIV)
    MCG->C6 = (uint8_t)((MCG->C6 & ~MCG_C6_VDIV0_MASK) | MCG_C6_VDIV0(config->vdiv));
#endif /* FSL_FEATURE_MCG_HAS_PLL_VDIV */

    /* Set enable mode. */
    MCG->C5 |= ((uint8_t)kMCG_PllEnableIndependent | (uint8_t)config->enableMode);

    /* Wait for PLL lock. */
    while (((MCG->S & MCG_S_LOCK0_MASK)) == 0U)
    {
    }
}

#if (defined(FSL_FEATURE_MCG_HAS_PLL1) && FSL_FEATURE_MCG_HAS_PLL1)
/*!
 * brief Enables the PLL1 in FLL mode.
 *
 * This function sets up the PLL1 in FLL mode and reconfigures
 * the PLL1. Ensure that the PLL reference
 * clock is enabled and that the PLL1 is not used as a clock source before calling this function.
 * The function CLOCK_CalcPllDiv gets the correct PLL
 * divider values.
 *
 * param config Pointer to the configuration structure.
 */
void CLOCK_EnablePll1(mcg_pll_config_t const *config)
{
    assert(config);

    uint8_t mcg_c11;

    mcg_c11  = MCG->C11 & MCG_C11_PLLCS_MASK;
    MCG->C11 = mcg_c11; /* Disable the PLL1. */
    MCG->C12 = (MCG->C12 & ~MCG_C12_VDIV1_MASK) | MCG_C12_VDIV1(config->vdiv);
    MCG->C11 = mcg_c11 | MCG_C11_PLLREFSEL1(config->refSrc) | MCG_C11_PRDIV1(config->prdiv) |
               (uint32_t)kMCG_PllEnableIndependent | (uint32_t)config->enableMode;

    /* Wait for PLL lock. */
    while (!(MCG->S2 & MCG_S2_LOCK1_MASK))
    {
    }
}
#endif /* FSL_FEATURE_MCG_HAS_PLL1 */

#endif /* FSL_FEATURE_MCG_HAS_PLL */

#if ((defined(FSL_FEATURE_MCG_HAS_EXTERNAL_PLL) && FSL_FEATURE_MCG_HAS_EXTERNAL_PLL) || \
     (defined(FSL_FEATURE_MCG_HAS_PLL1) && FSL_FEATURE_MCG_HAS_PLL1))
/*!
 * brief Set the PLL selection.
 *
 * This function sets the PLL selection between PLL0/PLL1/EXTPLL, and waits for
 * change finished.
 *
 * param pllcs The PLL to select.
 */
void CLOCK_SetPllClkSel(mcg_pll_clk_select_t pllcs)
{
    MCG->C11 = (uint8_t)(((MCG->C11 & ~MCG_C11_PLLCS_MASK)) | MCG_C11_PLLCS(pllcs));
    while ((uint32_t)pllcs != MCG_S2_PLLCST_VAL)
    {
    }
}
#endif /* FSL_FEATURE_MCG_HAS_PLL1 || FSL_FEATURE_MCG_HAS_EXTERNAL_PLL */

/*!
 * brief Sets the OSC0 clock monitor mode.
 *
 * This function sets the OSC0 clock monitor mode. See ref mcg_monitor_mode_t for details.
 *
 * param mode Monitor mode to set.
 */
void CLOCK_SetOsc0MonitorMode(mcg_monitor_mode_t mode)
{
    /* Clear the previous flag, MCG_SC[LOCS0]. */
    MCG->SC &= ~(uint8_t)MCG_SC_ATMF_MASK;

    if (kMCG_MonitorNone == mode)
    {
        MCG->C6 &= ~(uint8_t)MCG_C6_CME0_MASK;
    }
    else
    {
        if (kMCG_MonitorInt == mode)
        {
            MCG->C2 &= ~(uint8_t)MCG_C2_LOCRE0_MASK;
        }
        else
        {
            MCG->C2 |= MCG_C2_LOCRE0_MASK;
        }
        MCG->C6 |= MCG_C6_CME0_MASK;
    }
}

#if (defined(FSL_FEATURE_SOC_OSC_COUNT) && (FSL_FEATURE_SOC_OSC_COUNT > 1u))
/*!
 * brief Sets the OSC1 clock monitor mode.
 *
 * This function sets the OSC1 clock monitor mode. See ref mcg_monitor_mode_t for details.
 *
 * param mode Monitor mode to set.
 */
void CLOCK_SetOsc1MonitorMode(mcg_monitor_mode_t mode)
{
    /* Clear previous flag. MCG_S2[LOCS2]. */
    MCG->S2 = MCG_S2_LOCS2_MASK;

    if (kMCG_MonitorNone == mode)
    {
        MCG->C12 &= ~MCG_C12_CME2_MASK;
    }
    else
    {
        if (kMCG_MonitorInt == mode)
        {
            MCG->C10 &= ~MCG_C10_LOCRE2_MASK;
        }
        else
        {
            MCG->C10 |= MCG_C10_LOCRE2_MASK;
        }
        MCG->C12 |= MCG_C12_CME2_MASK;
    }
}
#endif /* (FSL_FEATURE_SOC_OSC_COUNT > 1u) */

#if (defined(FSL_FEATURE_MCG_HAS_RTC_32K) && FSL_FEATURE_MCG_HAS_RTC_32K)
/*!
 * brief Sets the RTC OSC clock monitor mode.
 *
 * This function sets the RTC OSC clock monitor mode. See ref mcg_monitor_mode_t for details.
 *
 * param mode Monitor mode to set.
 */
void CLOCK_SetRtcOscMonitorMode(mcg_monitor_mode_t mode)
{
    uint8_t mcg_c8 = MCG->C8;

    mcg_c8 &= ~(uint8_t)(MCG_C8_CME1_MASK | MCG_C8_LOCRE1_MASK);

    if (kMCG_MonitorNone != mode)
    {
        if (kMCG_MonitorReset == mode)
        {
            mcg_c8 |= MCG_C8_LOCRE1_MASK;
        }
        mcg_c8 |= MCG_C8_CME1_MASK;
    }
    MCG->C8 = mcg_c8;
}
#endif /* FSL_FEATURE_MCG_HAS_RTC_32K */

#if (defined(FSL_FEATURE_MCG_HAS_PLL) && FSL_FEATURE_MCG_HAS_PLL)
/*!
 * brief Sets the PLL0 clock monitor mode.
 *
 * This function sets the PLL0 clock monitor mode. See ref mcg_monitor_mode_t for details.
 *
 * param mode Monitor mode to set.
 */
void CLOCK_SetPll0MonitorMode(mcg_monitor_mode_t mode)
{
#if (defined(FSL_FEATURE_MCG_HAS_LOLRE) && FSL_FEATURE_MCG_HAS_LOLRE)
    uint8_t mcg_c8;
#else
    assert(mode != kMCG_MonitorReset);
#endif

    /* Clear previous flag. */
    MCG->S = MCG_S_LOLS0_MASK;

    if (kMCG_MonitorNone == mode)
    {
        MCG->C6 &= (uint8_t)(~MCG_C6_LOLIE0_MASK);
    }
    else
    {
#if (defined(FSL_FEATURE_MCG_HAS_LOLRE) && FSL_FEATURE_MCG_HAS_LOLRE)
        mcg_c8 = MCG->C8;

#if (defined(FSL_FEATURE_MCG_HAS_RTC_32K) && FSL_FEATURE_MCG_HAS_RTC_32K)
        mcg_c8 &= (uint8_t)(~MCG_C8_LOCS1_MASK);
#endif /* FSL_FEATURE_MCG_HAS_RTC_32K */

        if (kMCG_MonitorInt == mode)
        {
            mcg_c8 &= (uint8_t)(~MCG_C8_LOLRE_MASK);
        }
        else
        {
            mcg_c8 |= MCG_C8_LOLRE_MASK;
        }
        MCG->C8 = mcg_c8;
#endif /* FSL_FEATURE_MCG_HAS_LOLRE */
        MCG->C6 |= MCG_C6_LOLIE0_MASK;
    }
}

#if (defined(FSL_FEATURE_MCG_HAS_PLL1) && FSL_FEATURE_MCG_HAS_PLL1)
/*!
 * brief Sets the PLL1 clock monitor mode.
 *
 * This function sets the PLL1 clock monitor mode. See ref mcg_monitor_mode_t for details.
 *
 * param mode Monitor mode to set.
 */
void CLOCK_SetPll1MonitorMode(mcg_monitor_mode_t mode)
{
    assert(mode != kMCG_MonitorReset);

    /* Clear previous flag. */
    MCG->S2 = MCG_S2_LOLS1_MASK;

    if (kMCG_MonitorNone == mode)
    {
        MCG->C12 &= ~MCG_C12_LOLIE1_MASK;
    }
    else
    {
        MCG->C12 |= MCG_C12_LOLIE1_MASK;
    }
}
#endif /* FSL_FEATURE_MCG_HAS_PLL1 */

#if (defined(FSL_FEATURE_MCG_HAS_EXTERNAL_PLL) && FSL_FEATURE_MCG_HAS_EXTERNAL_PLL)
/*!
 * brief Sets the external PLL clock monitor mode.
 *
 * This function ets the external PLL clock monitor mode. See ref mcg_monitor_mode_t
 * for details.
 *
 * param mode Monitor mode to set.
 */
void CLOCK_SetExtPllMonitorMode(mcg_monitor_mode_t mode)
{
    uint8_t mcg_c9 = MCG->C9;

