nxp-mcuxpresso/mcux-sdk/devices/MKM14ZA5/drivers/fsl_clock.c
#if (defined(FSL_FEATURE_MCG_HAS_PLL) && FSL_FEATURE_MCG_HAS_PLL)

#if ((defined(FSL_FEATURE_MCG_HAS_PLL1) && FSL_FEATURE_MCG_HAS_PLL1) || \
     (defined(FSL_FEATURE_MCG_HAS_EXTERNAL_PLL) && FSL_FEATURE_MCG_HAS_EXTERNAL_PLL))
    mcg_pll_clk_select_t pllcs = config->pllcs;
#else
    mcg_pll_clk_select_t pllcs = kMCG_PllClkSelPll0;
#endif

#endif /* FSL_FEATURE_MCG_HAS_PLL */

#if (defined(FSL_FEATURE_MCG_USE_OSCSEL) && FSL_FEATURE_MCG_USE_OSCSEL)
    /* If need to change external clock, MCG_C7[OSCSEL]. */
    if (MCG_C7_OSCSEL_VAL != (uint8_t)(config->oscsel))
    {
        /* If external clock is in use, change to FEI first. */
        if ((uint8_t)kMCG_FllSrcExternal == MCG_S_IREFST_VAL)
        {
            (void)CLOCK_ExternalModeToFbeModeQuick();
            (void)CLOCK_SetFeiMode(config->dmx32, config->drs, NULL);
        }

        (void)CLOCK_SetExternalRefClkConfig(config->oscsel);
    }
#endif /* FSL_FEATURE_MCG_USE_OSCSEL */

    /* Re-configure MCGIRCLK, if MCGIRCLK is used as system clock source, then change to FEI/PEI first. */
    if (MCG_S_CLKST_VAL == (uint8_t)kMCG_ClkOutStatInt)
    {
        MCG->C2 &= ~(uint8_t)MCG_C2_LP_MASK; /* Disable lowpower. */

#if (defined(FSL_FEATURE_MCG_HAS_PLL_INTERNAL_MODE) && FSL_FEATURE_MCG_HAS_PLL_INTERNAL_MODE)
        if ((MCG->S & MCG_S_PLLST_MASK) != 0U)
        {
            (void)CLOCK_SetPeiMode();
        }
        else
#endif
        {
            (void)CLOCK_SetFeiMode(config->dmx32, config->drs, CLOCK_FllStableDelay);
        }
    }

    /* Configure MCGIRCLK. */
    (void)CLOCK_SetInternalRefClkConfig(config->irclkEnableMode, config->ircs, config->fcrdiv);

    next_mode = CLOCK_GetMode();

    do
    {
        next_mode = mcgModeMatrix[next_mode][config->mcgMode];

        switch (next_mode)
        {
            case kMCG_ModeFEI:
                status = CLOCK_SetFeiMode(config->dmx32, config->drs, CLOCK_FllStableDelay);
                break;
            case kMCG_ModeFEE:
                status = CLOCK_SetFeeMode(config->frdiv, config->dmx32, config->drs, CLOCK_FllStableDelay);
                break;
            case kMCG_ModeFBI:
                status = CLOCK_SetFbiMode(config->dmx32, config->drs, NULL);
                break;
            case kMCG_ModeFBE:
                status = CLOCK_SetFbeMode(config->frdiv, config->dmx32, config->drs, NULL);
                break;
            case kMCG_ModeBLPI:
                status = CLOCK_SetBlpiMode();
                break;
            case kMCG_ModeBLPE:
                status = CLOCK_SetBlpeMode();
                break;
#if (defined(FSL_FEATURE_MCG_HAS_PLL) && FSL_FEATURE_MCG_HAS_PLL)
            case kMCG_ModePBE:
#if (defined(FSL_FEATURE_MCG_HAS_PLL_INTERNAL_MODE) && FSL_FEATURE_MCG_HAS_PLL_INTERNAL_MODE)
                status = CLOCK_SetPbeMode(pllcs, &config->pll0Config);
#else /* FSL_FEATURE_MCG_HAS_PLL_INTERNAL_MODE */
                /* If target mode is not PBE or PEE, then only need to set CLKS = EXT here. */
                if ((kMCG_ModePEE == config->mcgMode) || (kMCG_ModePBE == config->mcgMode))
                {
#if ((defined(FSL_FEATURE_MCG_HAS_PLL1) && FSL_FEATURE_MCG_HAS_PLL1) || \
     (defined(FSL_FEATURE_MCG_HAS_EXTERNAL_PLL) && FSL_FEATURE_MCG_HAS_EXTERNAL_PLL))
                    if (kMCG_PllClkSelPll0 == pllcs)
#endif
                    {
                        status = CLOCK_SetPbeMode(pllcs, &config->pll0Config);
                    }
#if (defined(FSL_FEATURE_MCG_HAS_PLL1) && FSL_FEATURE_MCG_HAS_PLL1)
                    else if (kMCG_PllClkSelPll1 == pllcs)
                    {
                        status = CLOCK_SetPbeMode(pllcs, &config->pll1Config);
                    }
#endif /* FSL_FEATURE_MCG_HAS_PLL1 */
#if (defined(FSL_FEATURE_MCG_HAS_EXTERNAL_PLL) && FSL_FEATURE_MCG_HAS_EXTERNAL_PLL)
                    else if (kMCG_PllClkSelExtPll == pllcs)
                    {
                        status = CLOCK_SetPbeMode(pllcs, NULL);
                    }
#endif /* FSL_FEATURE_MCG_HAS_EXTERNAL_PLL */
#if ((defined(FSL_FEATURE_MCG_HAS_PLL1) && FSL_FEATURE_MCG_HAS_PLL1) || \
     (defined(FSL_FEATURE_MCG_HAS_EXTERNAL_PLL) && FSL_FEATURE_MCG_HAS_EXTERNAL_PLL))
                    else
                    {
                        /* Add comment to prevent the case of MISRA C-2012 rule 15.7 */
                    }
#endif
                }
                else
                {
                    MCG->C1 = (uint8_t)((MCG->C1 & ~MCG_C1_CLKS_MASK) | MCG_C1_CLKS(kMCG_ClkOutSrcExternal));
                    while (MCG_S_CLKST_VAL != (uint8_t)kMCG_ClkOutStatExt)
                    {
                    }
                }
#endif /* FSL_FEATURE_MCG_HAS_PLL_INTERNAL_MODE */
                break;
            case kMCG_ModePEE:
                status = CLOCK_SetPeeMode();
                break;
#if (defined(FSL_FEATURE_MCG_HAS_PLL_INTERNAL_MODE) && FSL_FEATURE_MCG_HAS_PLL_INTERNAL_MODE)
            case kMCG_ModePBI:
                status = CLOCK_SetPbiMode();
                break;
            case kMCG_ModePEI:
                status = CLOCK_SetPeiMode();
                break;
#endif /* FSL_FEATURE_MCG_HAS_PLL_INTERNAL_MODE */
#endif
            default:
                assert(false);
                break;
        }
        if (kStatus_Success != status)
        {
            break;
        }
    } while (next_mode != config->mcgMode);

#if (defined(FSL_FEATURE_MCG_HAS_PLL) && FSL_FEATURE_MCG_HAS_PLL)
    if (status == kStatus_Success)
    {
        if ((config->pll0Config.enableMode & (uint8_t)kMCG_PllEnableIndependent) != 0U)
        {
            CLOCK_EnablePll0(&config->pll0Config);
        }
        else
        {
            MCG->C5 &= ~(uint8_t)kMCG_PllEnableIndependent;
        }
#if (defined(FSL_FEATURE_MCG_HAS_PLL1) && FSL_FEATURE_MCG_HAS_PLL1)
        if ((config->pll1Config.enableMode & kMCG_PllEnableIndependent) != 0U)
        {
            CLOCK_EnablePll1(&config->pll1Config);
        }
        else
        {
            MCG->C11 &= ~(uint32_t)kMCG_PllEnableIndependent;
        }
#endif /* FSL_FEATURE_MCG_HAS_PLL1 */
    }
#endif /* FSL_FEATURE_MCG_HAS_PLL */

    return status;
}
